Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/housing_grants_and_schemes/older_people_housing.html.txt.tmx
Source language: en
Languages: ga

source: Housing for older people
ga: Tithe do Dhaoine Aosta

source: Local authorities are obliged to provide housing for older people on broadly the same basis as for the rest of the population
ga: Tá dualgas ar na húdaráis áitiúla tithíocht a chur ar fáil do dhaoine aosta ar mórán an bunús céanna leis an gcuid eile den daonra

source: In general, they take age into account when prioritising applications for housing
ga: Go ginearálta, cuireann na húdaráis áitiúla cás faoi leith na ndaoine aosta san áireamh agus a riachtanais i dtaobh tithe dhá mheas acu

source: Some local authorities and voluntary organisations provide specific housing for older people
ga: Cuireann roinnt údaráis áitiúla agus eagraíochtaí deonacha tithíocht faoi leith ar fáil do dhaoine aosta

source: There are some housing-related grants that are particularly relevant to older people or people with disabilities. In addition, the VAT refund scheme on aids and appliances used by people with disabilities also applies to the cost of installation and adaptation work
ga: Tá deontais tithe ar fáil a bhaineann go speisialta le daoine aosta agus le daoine le míchumais.Is féidir aisíocaíocht CBL a éileamh ar áiseanna agus trealamh atá in úsáid ag duine atá faoi mhíchumas agus ar an obair shuiteála freisin

source: Some local authorities provide special accommodation for older people - usually community accommodation with special security features, such as wardens and security cameras
ga: Cuireann roinnt de na húdaráis áitiúla tithíocht speisialta ar fáil do dhaoine aosta. Comhthithíocht a bhíonn inti go hiondúil, le háiseanna speisialta slándála, mar shampla, maoranna, ceamaraí slándála agus rl

source: Each local authority allocates housing in accordance with its own housing allocation scheme (formerly known as schemes of letting priorities)
ga: Déanann gach údarás áitiúil tithíocht a leithdháileadh i gcomhréir lena scéim féin leithdháilte (ar ar tugadh scéimeanna tosaíochtaí ligin roimhe seo)

source: Age limits for older people’s accommodation can vary from one local authority’s housing allocation scheme to another
ga: Féadfaidh aoisteorainneacha le haghaidh cóiríocht do dhaoine breacaosta bheith éagsúil i measc scéimeanna leithdháilte tithíochta údaráis áitiúil

source: Check with your own local authority
ga: Seiceáil le d’údarás áitiúil féin

source: Voluntary housing organisations provide housing in a similar way to local authorities
ga: Cuireann eagraíochtaí tithíochta deonacha tithíocht ar fáil ar an mbunús céanna mórán leis an údarás áitiúil

source: They provide two types of housing for older people: group schemes and sheltered housing
ga: Cuireann siad dhá chineál tithíochta ar fáil do dhaoine aosta - scéimeanna grúpa agus tithíocht faoi dhídean

source: They have some discretion about whom they house, but most of their housing is assigned in consultation with the local authority
ga: Bíonn rogha áirithe acu maidir leis na daoine a gcuireann siad tithe ar fáil dóibh ach is i gcomhair leis an údarás áitiúil don chuid is mó a chuireann siad tithíocht ar fáil

source: Tenants in sheltered housing pay rent and they may qualify for Rent Supplement
ga: Íocann tionóntaithe i dtithíocht faoi dhídean cíos agus d'fhéadfaidís bheith i dteideal Forlíonadh Cíosa a fháil

source: Most of these organisations are community-based and were set up to meet specific housing needs
ga: Eagraíochtaí pobail iad formhór na n-eagraíochtaí seo agus d'fhás siad as riachtanas speisialta aitheanta tithíochta taobh istigh den phobal sin

source: They are known as 'approved housing bodies' as they must be approved by the Department of Housing, Planning, Community and Local Government
ga: Ní mór dóibh aitheantas a fháil ón Roinn Tithíochta, Pleanála, Pobal agus Rialtais Áitiúil

source: Housing Aid for Older Persons Scheme
ga: Scéim um Chúnamh Tithíochta do Dhaoine Breacaosta

source: The Housing Aid for Older Persons Scheme aims to improve the living conditions of older people by carrying out minor repairs to the main areas of their homes
ga: Tá an Scéim um Chúnamh Tithíochta do Dhaoine Breacaosta ann chun coinníollacha maireachtála a fheabhsú do dhaoine níos sine trí mhiondeisiúcháin a dhéanamh ar na príomháiteanna i dteach an tseanduine

source: The type of work that is grant-aided varies from one local authority to another
ga: Ta difríochtaí idir údaráis áitiúla mar gheal ar an cineál oibre a mbeidh cúnamh deontais ar fáil dó

source: In general, it can include structural repairs or improvements; rewiring; repair or replacement of windows and doors; the provision of water, sanitary services or heating; cleaning and painting; radon remediation; and any other repair or improvement work considered necessary
ga: Go ginearálta, beidh deisiúcháin nó feabhsúcháin struchtúrtha, athsreangú, soláthar uisce, seirbhísí sláintíochta, téamh, glanadh agus péinteáil i gceist

source: Check with your local authority to see what types of work it covers under the scheme
ga: Déan teagmháil le d'údarás áitiúil chun a fháil amach cé'n sórt oibre a chistíonn sé faoin scéim

source: Housing Adaptation Grant for People with a Disability
ga: Deontas Oiriúnaithe Tithe do Dhaoine faoi Mhíchumas

source: If you need to adapt your home to meet the needs of a member of the household who has a disability, you can apply for a Housing Adaptation Grant for People with a Disability
ga: Más gá duit do theach a oiriúnú chun riachtanais atá ag duine den teaghlach atá faoi mhíchumas a shásamh, is féidir leat iarratas a dhéanamh ar Dheontas Oiriúnaithe Tithe do Dhaoine faoi Mhíchumas

source: The grant can help you to make changes and adaptations to your home, for example, making it wheelchair-accessible, extending it to create more space, adding a ground-floor bathroom or toilet or a stair-lift
ga: Féadfaidh an deontas cabhrú leat chun athruithe agus oiriúnuithe a dhéanamh ar do theach, mar shampla, teach a dhéanamh de atá inrochtana do chathaoireacha rothaí, an teach a shíneadh chun breis spáis a chruthú, seomra folctha nó leithreas ar urlár na talún nó cathaoir staighre a shuiteáil

source: If you are buying or building a new home, you may qualify for this grant, but at a lower rate
ga: Má tá teach nua á cheannach nó á thógáil agat, b’fhéidir go gcáileoidh tú don deontas seo, ach ar ráta níos ísle

source: Mobility Aids Grant Scheme
ga: An Scéim Deontas Áiseanna Soghluaisteachta

source: The Mobility Aids Grant Scheme provides grants for works designed to address mobility problems in the home
ga: Cuireann an Scéim Deontas Áiseanna Soghluaisteachta deontais ar fáil i gcomhair oibreacha atá deartha chun tabhairt faoi fhadhbanna soghluaisteachta sa bhaile

source: For example, the grant can be used for the purchase and installation of handrails
ga: Mar shampla, is féidir an deontas a úsáid chun greimráillí a cheannach agus a chur isteach

source: It is mainly for older people, but people with disabilities can also access it
ga: Is ar dhaoine níos sine atá an deontas seo dírithe, ach is féidir le daoine faoi mhíchumas tairbhe a bhaint as an scéim freisin

source: The amount of assistance you can get under this Scheme is less than under the Housing Aid for Older Persons Scheme and the Housing Adaptation Grant for People with a Disability
ga: Tá an méid cúnaimh atá ar fáil faoin Scéim Deontas Áiseanna Soghluaisteachta níos lú ná mar atá ar fáil faoin Scéim um Chúnamh Tithíochta do Dhaoine Breacaosta agus an Deontas Oiriúnaithe Tithe do Dhaoine faoi Mhíchumas

source: It is a useful scheme if you need minor adaptations or improvements done quickly
ga: Is scéim úsáideach í an Scéim Deontas Áiseanna Soghluaisteachta más gá duit mionoiriúnuithe nó feabhsú a dhéanamh go tapa

source: Better Energy Warmer Homes Scheme
ga: An Scéim Fuinneamh Níos Fearr, Tithe Níos Teo

source: The Better Energy Warmer Homes Scheme aims to improve the energy efficiency and warmth of homes owned by people on low incomes
ga: Tá de chuspóir na Scéime Fuinneamh Níos Fearr, Tithe Níos Teo chun feabhas a chur ar éifeachtachtúlacht fuinnimh agus ar theas tithe atá faoi úinéireacht daoine a bhfuil ioncam íseal á fháil acu

source: It is operated by the Sustainable Energy Authority of Ireland (SEAI) and is available nationwide
ga: Déanann Údarás Fuinnimh Inmharthana na hÉireann (an SEAI) an scéim a oibriú agus tá sí ar fáil ar fud na tíre

source: It covers attic insulation, draught-proofing, lagging jackets, energy-efficient bulbs, cavity wall insulation and energy advice
ga: Cumhdaíonn sí insliú áiléir, teach a dhéanamh díonmhar ar shéideáin, seaicéid fálaithe, bolgáin atá éifeachtúil i dtaobh fuinnimh de, insliú cuasbhalla agus comhairle faoi fhuinneamh

source: Security measures for older people
ga: Áiseanna slandála do dhaoine aosta

source: The Seniors Alert Scheme provides funds to local community and voluntary organisations to install personal monitored alarms and items of home security
ga: Cuireann an Scéim Thacaíochta Pobail do Dhaoine Níos Sine maoiniú ar fáil d'eagraíochtaí deonacha agus pobail le córais rabhcháin a bhfuil monatóireacht phearsanta dhá dhéanamh orthu agus áiseanna slándála baile a chur ar fáil do dhaoine aosta

source: Grants can be made to provide security measures for people aged 65 or over who are living alone, or only with other older people, and who are unable themselves to install or buy such equipment
ga: Cuireann an scéim deontais ar fáil le háiseanna slándála a chur ar fáil do daoine atá 65 nó ós a chionn agus a chónaíonn ina n-aonair, nó a chónaíonn i líon tí nach bhfuil ach daoine aosta eile ann, agus nach bhfuil in ann iad féin an trealamh cuí a chur isteach nó a cheannach

source: To apply for local authority housing, fill in an application form and send it to your local authority
ga: Chun iarratas a dhéanamh ar thithíocht údaráis áitiúil, comhlánaigh foirm iarratais agus seol ar aghaidh í chuig d’údarás áitiúil

source: If you are interested in becoming a tenant of a voluntary housing association, you should first apply to your local authority for housing and have your housing need assessed
ga: Más spéis leat bheith i do thionónta i gcomhlachas tithíochta deonaí, ba cheart duit iarratas a dhéanamh, ar dtús, le d’údarás áitiúil ar thithíocht agus ba cheart go ndéanfaí do riachtanas tithíochta a mheasúnú

source: For the Housing Aid for Older People Scheme, Mobility Aids Grant or Housing Adaptation Grant for People with a Disability, download the relevant application form from your local authority’s website and send the completed form to your local authority
ga: I dtaobh na Scéime um Chúnamh Tithíochta do Dhaoine Breacaosta, an Deontais Áiseanna Soghluaisteachta nó an Deontais Oiriúnaithe Tithíochta do Dhaoine faoi Mhíchumas, íoslódáil an fhoirm ábhartha iarratais ó láithreán gréasáin d’údaráis áitiúil agus seol an fhoirm chomhlánaithe chuig d’údarás áitiúil

source: For the Better Energy Warmer Homes Scheme, contact SEAI on 1800 250 204 or email warmerhomes@seai.ie
ga: I dtaobh na Scéime Fuinneamh Níos Fearr, Tithe Níos Teo, déan teagmháil leis an SEAI trí ghlao ar 1800 250 204 nó trí ríomhphost a sheoladh chuig warmerhomes@seai.ie

source: Contact details for Seniors Alert are in our document on this scheme
ga: Tá sonraí teagmhála don Scéim Rabhaidh do Sheanóirí ar fáil inár gcáipéis faoin scéim seo
